Repository: clouded-eas/Pidgin-Encryption-sj
Catalog: po/*.po
Languages: it

source: Bad key size
it: Dimensione della chiave sbagliato

source: Keys < 512 bits are VERY insecure
it: Le chiavi < 512 sono MOLTO insicure

source: Keys > 4096 bits will cause extreme message bloat, causing problems with message transmission
it: Le chiavi > 4096 bits possono causare rigonfiamenti estremi dei messaggi, che possono causare problemi con l'invio dei messaggi stessi

source: Generate Keys
it: Genera le Chiavi

source: No key selected to re-generate!
it: Nessuna chiave da rigenerare selzionata!

source: Encryption protocol:
it: Protocollo crittato:

source: Key size:
it: Dimensione della chiave:

source: Cancel
it: Annulla

source: Delete Key
it: Rimuovi la Chiave

source: Name
it: Nome

source: Key Fingerprint
it: Fingerprint della chiave

source: Config
it: Configura

source: Accept key automatically if no key on file
it: Accetta la chiave automaticamente se non ci sono chiavi nel file

source: Accept conflicting keys automatically (security risk)
it: Accetta le chiavi in conflitto automaticamente (rischio per la sicurezza)

source: Automatically encrypt if sent an encrypted message
it: Critta automaticamente se e' stato inviato un messaggio crittografato

source: Broadcast encryption capability
it: Possibilita' di crittografia in Broadcast

source: Automatically encrypt if buddy has plugin
it: Critta automaticamente se il contatto possiede il plug-in

source: Show lock icon for each line of chat
it: Mostra l'icona del lucchetto per ogni riga di chat

source: Keyfile location
it: Locazione dei File di Chiave

source: Create key files
it: Crea Files di Chiave

source: Regenerate Key
it: Rigenera la Chiave

source: Copy Fingerprint to Clipboard
it: Copia il Fingerprint negli appunti

source: Local Keys
it: Chiavi Locali

source: Trusted Buddy Keys
it: Chiavi dei Contatti Cestinate

source: Recent Buddy Keys
it: Chiavi Recenti dei Contatti

source: No key files found at path
it: Nessuna chiave trovata nel percorso specificato

source: Absolute path required
it: Percorso Assoluto richiesto

source: Unable to create key files
it: Non sono riuscito a crare i files delle chiavi

source: This account key is too large for this protocol. Unable to send.
it: La chiave di questo account per questo protocollo e' troppo grande. Impossibile inviarla.

source: Last outgoing message not received properly- resetting
it: L'ultimo messaggio in uscita non e' stato ricevuto correttamente- reset del messaggio

source: Received message encrypted with wrong key
it: Ricevuto un messaggio crittato con una chiave errata

source: Error in decryption- asking for resend...
it: Errore nella decrittazione- richiesta di reinvio...

source: Requesting key...
it: Richiesta della chiave...

source: No key to resend message. Message lost.
it: Nessuna chiave per rinviare il messaggio. Messaggio perduto.

source: Outgoing message lost.
it: Messaggio in uscita perduto.

source: Encrypts conversations with RSA encryption.
it: Conversazione crittata con codifica RSA.

source: RSA encryption with keys up to 4096 bits, using the Mozilla NSS crypto library.
it: Crittazione RSA con chiavi fino a 4096 bits, utilizzata la libreria NSS crypto di Mozilla.

source: Turn Auto-Encrypt Off
it: Disabilita l'autocrittazione

source: Turn Auto-Encrypt On
it: Abilita l'autocrittazione

source: Making new key pair...
it: Creazione di un nuovo paio di chiavi...

source: Error trying to make key.
it: Errore durante la creazione della chiave.

source: Conflicting Key Received!
it: Chiave Conflittuosa Ricevuta!

source: Error changing access mode for file: %s Cannot save key.
it: Errore nel cambiamento del modo di accesso al file: %s Impossibile salvare la chiave.

source: Error (2) changing access mode for file: %s Cannot save key.
it: Errore (2) nel cambiamento del modo di accesso al file: %s Impossibile salvare la chiave.

source: Pidgin-Encryption Key Received
it: Chiave per Pidgin-Encryption Ricevuta

source: %s key received for '%s'
it: %s ricevuta una chiave per '%s'

source: Key Fingerprint:%*s
it: Fingerprint della Chiave:%*s

source: Do you want to accept this key?
it: Vuoi accettare la chiave?

source: Accept and Save
it: Accetta e Salva

source: This session only
it: Solo per questa sessione

source: CONFLICTING Pidgin-Encryption Key Received
it: Chiave per Pidgin-Encryption CONFLITTUOSA Ricevuta

source: ******* WARNING *******
it: ******* ATTENZIONE *******

source: CONFLICTING %s key received for '%s'!
it: La chiave %s ricevuta per '%s' e' in CONFLITTO!

source: This could be a man-in-the-middle attack, or could be someone impersonating your buddy. You should check with your buddy to see if they have generated this new key before trusting it.
it: Questo potrebbe essere un'attacco man-in-the-middle, oppure potrebbe essere qualcuno che impersonifica il tuo contatto. Devi controllare col tuo contatto se ha generato la nuova chiave prima di autorizzarla.

source: Generating RSA Key Pair for %s
it: Generazione di un Paio di Chiavi RSA per %s

source: This may take a little bit...
it: Questa operazione potrebbe durare un bel po'...

source: Could not generate key. NSS Error: %d
it: Impossibile generare la chiave. Errore NSS: %d

source: Error parsing RSANSS key
it: Errore nel parsing RSANSS della chiave

source: Bad signature on message (len %d, mod %d)
it: Firma errata nel messaggio (lun %d, mod %d)

source: Enable Encryption
it: Abilita Crittazione

source: Disable Encryption
it: Disabilita Crittazione

source: The last message received was encrypted with the Pidgin-Encryption plugin
it: L'ultimo messaggio ricevuto e' stato crittato con Pidgin-Encryption
